[
  {
    "id": "1",
    "imgSrc": "investmentLogo",
    "imgAlt": "Investment Calculator picture",
    "title": "INVESTMENT CALCULATOR",
    "details": "A straightforward Angular app for calculating investment growth based on user inputs: starting amount, annual contributions, years, and interest rate. It provides clear projections of future investment value, showcasing Angular’s strength in building dynamic, interactive applications.",
    "techs": "JAVASCRIPT, ANGULAR.",
    "github": "https://github.com/FigueiredoFelipe/investment-calculator",
    "liveDemo": "https://investment-calculator-puce.vercel.app/"
  },
  {
    "id": "2",
    "imgSrc": "goalslistapp",
    "imgAlt": "Goals List Application picture",
    "title": "GOALS LIST APPLICATION",
    "details": "This project is a Goals List App built with React Native and Expo. It allows users to add and delete goals by clicking on them. The app includes input validation, a clean-up function for canceled additions, a modal, and organized code structure following best practices. Demonstrates skills in mobile app development with React Native and JavaScript.",
    "techs": "JAVASCRIPT, REACT NATIVE, EXPO.",
    "github": "https://github.com/FigueiredoFelipe/GoalsListApp-RNative",
    "liveDemo": "https://www.youtube.com/watch?v=enMEldNcfK0"
  },
  {
    "id": "3",
    "imgSrc": "todoapp",
    "imgAlt": "To-do List Application picture",
    "title": "TO-DO LIST APPLICATION",
    "details": "This project is a fully functional To-do List App allowing users to add, delete, and reorder tasks. It includes validation for empty tasks and demonstrates effective state management and UI design. Showcases my front-end skills with HTML5, CSS3, JavaScript, React, TypeScript, Tailwind CSS, and Next.js.",
    "techs": "HTML5, CSS3, JAVASCRIPT, TYPESCRIPT, REACT, TAILWIND, NEXT.JS.",
    "github": "https://github.com/FigueiredoFelipe/next-to-do-list",
    "liveDemo": "https://next-to-do-list-nine.vercel.app/"
  },
  {
    "id": "4",
    "imgSrc": "felipedev",
    "imgAlt": "Felipe Figueiredo Portfolio",
    "title": "FELIPE FIGUEIREDO PORTFOLIO",
    "details": "As part of this project, I will showcase my front-end development skills, including HTML5, CSS3, JavaScript, React, TypeScript, Tailwind CSS, Next.js, and more. In addition to demonstrating my passion for web development, it gives potential clients an overview of my past work and capabilities.",
    "techs": "HTML5, CSS3, JAVASCRIPT, TYPESCRIPT, REACT, TAILWIND, NEXT.JS AND SANITY.",
    "github": "https://github.com/FigueiredoFelipe/next-portfolio",
    "liveDemo": "https://felipefigueiredodev.vercel.app"
  },
  {
    "id": "5",
    "imgSrc": "agtvw610",
    "imgAlt": "Arena Gaming Tv web site",
    "title": "ARENA GAMING TV",
    "details": "Collaborated with Arena Gaming TV to develop a countdown timer, news section, store, live stream list, and archives. With PHP, HTML, CSS3, and JS, we built a robust UI. Increased income by 29%, and ranked first on Google. Planned, deployed, tested, and supported.",
    "techs": "PHP, HTML, CSS",
    "github": "",
    "liveDemo": ""
  },
  {
    "id": "6",
    "imgSrc": "advnegreiros",
    "imgAlt": "Advocacia Negreiros",
    "title": "ADVOCACIA NEGREIROS",
    "details": "Integrated WordPress news system with responsive design.Enhanced visuals and functionality with CSS & JS.Building dynamic, engaging platforms with WordPress expertise.The result: a professional website that blends aesthetics and functionality.",
    "techs": "WORDPRESS, JAVASCRIPT",
    "github": "",
    "liveDemo": ""
  }
]
